kb1c/src/Catalogs/КатегорииБазыЗнаний/КатегорииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииБазыЗнаний</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

kb1c/src/InformationRegisters/ИзбранноеБазыЗнаний/ИзбранноеБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранноеБазыЗнаний</name>
  <resources>
    <name>Создание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Прочее</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияБазыЗнаний</name>
    <type>
      <types>CatalogRef.КатегорииБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/Enums/ВидыНовостейБазыЗнаний/ВидыНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНовостейБазыЗнаний</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

kb1c/src/Catalogs/КатегорииБазыЗнаний/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

// ТипНовости: 1 - создание, 2 - изменение, 3 - удаление
Функция ДобавитьНовостьБазыЗнаний(ТипНовости)
	
	ТекПользователь		= Пользователи.ТекущийПользователь();
	
	ПараметрыСсылкиОтв	= Новый Структура("id", Строка(ТекПользователь.УникальныйИдентификатор()));
	АдресСсылкиОтв		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("user", ПараметрыСсылкиОтв);
	
	ПараметрыСсылкиКат	= Новый Структура("id", Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	АдресСсылкиКат		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("category", ПараметрыСсылкиКат);
	
	Если ТипНовости = 1 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Создание;
		Заголовок	= "Новая категория '%3'";
		ТекстHTML	= "<div>%1 в %2 добавлена новая категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|	<br><a href='" + АдресСсылкиКат + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 3 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Удаление;
		Заголовок	= "Удалена категория '%3'";
		ТекстHTML	= "<div>%1 в %2 удалена категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|</div>";
	КонецЕсли;
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДЛФ=DD"));
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДФ=HH:mm"));
	МассивПараметров.Добавить(СокрЛП(ЭтотОбъект.Наименование));
	МассивПараметров.Добавить(Строка(ТекПользователь));
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(Заголовок, МассивПараметров);
	ТекстHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ТекстHTML, МассивПараметров);
	
	ПараметрыНовости = Новый Структура;
	ПараметрыНовости.Вставить("Автор"				, ТекПользователь);
	ПараметрыНовости.Вставить("Заголовок"			, Заголовок);
	ПараметрыНовости.Вставить("ТекстHTML"			, ТекстHTML);
	ПараметрыНовости.Вставить("ОбъектБазыЗнаний"	, ЭтотОбъект.Ссылка);
	ПараметрыНовости.Вставить("Важность"			, 2);
	ПараметрыНовости.Вставить("ВидНовости"			, ВидНовости);
	
	БазаЗнанийВызовСервера.ДобавитьНовость(ПараметрыНовости);
	
КонецФункции

Процедура ДобавитьКатегориюВИзбранное()
	
	МенеджерЗаписи = РегистрыСведений.ИзбранноеБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Создание				= Истина;
	МенеджерЗаписи.Изменение			= Истина;
	МенеджерЗаписи.Удаление				= Истина;
	МенеджерЗаписи.Оповещение			= Истина;
	МенеджерЗаписи.Прочее				= Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииОбновления = Новый Массив;
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		КатегорииОбновления.Добавить(ЭтотОбъект.Родитель);
	КонецЕсли;
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		РодительСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Родитель");
		Если ЗначениеЗаполнено(РодительСсылка) Тогда
			КатегорииОбновления.Добавить(РодительСсылка);
		КонецЕсли;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КатегорииОбновления", КатегорииОбновления);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КатегорииОбновления")
		И ТипЗнч(ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления) = Тип("Массив")
		И ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления.Количество() > 0 Тогда
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый Структура("Категории", ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления));
		
		ФоновыеЗадания.Выполнить(
			"БазаЗнаний.ОбновитьСтатистикуКатегорий",
			МассивПараметров, ,
			"Обновление статистики по категориям");
	КонецЕсли;

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ДобавитьКатегориюВИзбранное();
		
		ДобавитьНовостьБазыЗнаний(1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ДобавитьНовостьБазыЗнаний(3);
КонецПроцедуры
